Repository: educorvi/edi.jsonforms
Catalog: src/edi/jsonforms/locales/*/LC_MESSAGES/edi.jsonforms.po
Languages: de

source: A Complex is used to group fields together that are connected. Unlike normal fieldsets, a complex doesn't only group to enhance clarity and structure but to encapsulate related data or concepts. A Complex (including all contained fields, fieldsets, arrays, ...) can be dependent from the option of another field but a normal fieldset not.
de: Ein Objekt wird genutzt, um Felder zu gruppieren, die in Beziehung stehen. Anders als normale Feldgruppen, gruppiert ein Objekt nicht nur, um die Struktur zu verbessern, sondern kapselt verwandte Daten oder Konzepte. Ein Objekt (inklusive der beinhalteten Felder, Feldgruppen, Arrays, ...) kann abhängig von einem anderen Feld sein, eine normale Feldgruppe nicht.

source: A Field represents a specific data entry point within a Form where users input information. Various types are possible, such as textline, number, email and more.
de: Ein Feld repräsentiert ein spezifisches Eingabefeld innerhalb eines Fragebogens, in das der Nutzer Informationen eingeben kann. Einer von verschiedenen Typen kann ausgewählt werden, wie Textzeile, Dezimalzahl, Email, etc.

source: A Fieldset is used to logically group fields inside a Form, allowing users to organize related fields together. By encapsulating fields within a fieldset, users can enhance the clarity and structure of their questionnaires or forms. Fieldsets provide a means to categorize and visually organize fields, improving the usability.
de: Eine Feldgruppe wird verwendet, um Felder innerhalb eines Fragebogens zu gruppieren und verwandte Felder zu ordnen. Durch die Kapselung / Kategorisierung der Felder kann die Struktur des Fragebogens oder Formulars visuell verbessert werden.

source: A Placeholder is only possible if the answer type is one of the following: Textline, Textarea, Password, Telephone, URL, Email.
de: Ein Platzhalter ist nur möglich, wenn der Antworttyp einer der folgenden ist: Textzeile, Textfeld, Passwort, Telefonnummer, URL, Email.

source: A SelectionField offers users a range of options to choose from within a Form. These options consist of predefined values such as radio buttons, checkboxes, or dropdown lists. The type defines wether single or multiple selections are possible.
de: Ein Auswahlfeld bietet dem Nutzer eine Reihe von Antwortmöglichkeiten, aus denen er auswählen kann. Die Optionen sind vordefinierte Werte und können als Radioboxen, Checkboxen oder Dropdown-Listen angezeigt werden.

source: A container for forms.
de: Ein Behälter für Fragebögen.

source: A reference of a form element with new dependencies.
de: Eine Referenz eines Fragebogenelements mit neuen Abhängigkeiten.

source: Accepted file types for file upload
de: Akzeptierte Dateitypen für den Upload

source: Add button label
de: Label des Hinzufügeknopfes

source: Additional Information
de: Zusatzinformationen

source: Advanced Options
de: Erweiterte Optionen

source: An Array is a structured element that allows the repeated entry of related information by providing a template for a set of fields. It allows users to dynamically add additional sets of the same fields as needed. Arrays are particularly useful for capturing repetitive data entries, such as multiple contact or items in a list. An Array can be dependent from another field.
de: Ein Array ist ein strukturiertes Element, das die wiederholte Eingabe verwandter Informationen ermöglicht, indem es ein Template für eine Reihe von Feldern bietet. Es erlaubt dem Nutzer dynamisch die Anzahl der Array-Elemente, die jeweils gleich aufgebaut sind, auszuwählen. Arrays sind besonders nützlich, um wiederholte Daten zu speichern, z. B. mehrere Kontaktinformationen oder Elemente einer Liste. Arrays können von anderen Feldern abhängen.

source: An Option represents a specific choice available to users within a Form. Options define the predefined values that users can select from, such as specific items, categories, or responses.
de: Eine Option repräsentiert eine spezifische Auswahlmöglichkeit. Über sie kann ein Wert vordefiniert werden, wie Kategorien oder Antwortmöglichkeiten, die der Nutzer auswählen kann.

source: An OptionList represents a collection of predefined choices available to users within a Form. OptionLists define the predefined values that users can select from, such as specific items, categories, or responses.
de: Eine Optionenliste stellt eine Sammlung vordefinierter Auswahlmöglichkeiten dar, die Benutzern innerhalb eines Formulars zur Verfügung stehen. Optionenlisten definieren die vordefinierten Werte, aus denen Benutzer auswählen können, wie beispielsweise bestimmte Elemente, Kategorien oder Antworten.

source: Cannot be dependent from itself or a child from itself.
de: Eine Abhängigkeit von sich selbst oder einem eigenen Kindobjekt ist nicht möglich.

source: Check if you want to use the id of the options instead of the label/title in the schema
de: Anhaken, wenn die IDs der Optionen statt ihrer Label im Schema verwendet werden sollen

source: Checkbox (yes/no)
de: Checkbox (ja/nein)

source: Checkboxes (multi-selection)
de: Checkboxen (Mehrfachauswahl)

source: Choose the answer type
de: Auswahl des Antworttyps

source: Complex
de: Objekt

source: Condition for showing this field
de: Bedingung, um dieses Feld anzuzeigen

source: Content
de: Inhalt

source: Could not determine the parent Form.
de: Der Elternfragebogen konnte nicht gefunden werden.

source: Current JSON-Schema (Draft)
de: Aktuelles JSON-Schema (Entwurf)

source: Current UI-Schema (Draft)
de: Aktuelles UI-Schema (Entwurf)

source: Date
de: Datum

source: Date and time
de: Datum und Uhrzeit

source: Decimal number
de: Dezimalzahl

source: Delete
de: Löschen

source: Delete element
de: Element löschen

source: Dependencies
de: Abhängigkeiten

source: Dependent from this answer option:
de: Abhängig von folgender Antwortoption:

source: Description
de: Beschreibung

source: Description of the field/question
de: Beschreibung des Feldes bzw. der Frage

source: Developer Area
de: Entwicklerbereich

source: Developer Fields
de: Entwicklerfelder

source: Display upload field as array
de: Upload-Feld als Array darstellen

source: Edit
de: Bearbeiten

source: Edit element
de: Element bearbeiten

source: Field
de: Feld

source: Fieldset
de: Feldgruppe

source: For a number/integer this is the maximal value it can have. For a Textline/-area/Password this is the maximal length the text can have.
de: Für eine Dezimal-/Ganzzahl ist dies der maximale Wert, den sie haben kann. Für ein/eine Textzeile/Textfeld/Passwort ist dies die maximale Länge, die der Text haben kann.

source: For a number/integer this is the minimal value it must have. For a Textline/-area/Password this is the minimal length the text must have. (>=)
de: Für eine Dezimal-/Ganzzahl ist dies der minimale Wert, den sie haben muss. Für ein/eine Textzeile/Textfeld/Passwort ist dies die minimale Länge, die der Text haben muss. (>=)

source: Form
de: Fragebogen

source: Form View
de: Standard-Ansicht

source: Form view with tools
de: Werkzeug-Ansicht

source: Helptext
de: Hinweistext

source: Here you can provide additional information that the Software-Team should to take into account while creating the Form.
de: Hier können zusätzliche Informationen für das Software-Team bereitgestellt werden, die beachtet werden sollen, wenn der Fragebogen erstellt wird.

source: Hint or helptext for the user
de: Tooltip (Icon mit Popup-Fenster für Benutzerhinweise)

source: If no file type is selected, the default is * (all file types are accepted).
de: Wenn keine Dateitypen ausgewählt werden, ist der Default * (alle Dateitypen werden akzeptiert).

source: If this field(set) should only be displayed based on the answer to another question or a specific option chosen from another question, please specify the question or option it depends on. For example, if the other field is a text line, this field will only be shown if the text line is not empty. If the other field is a number field, this field will only be shown if there is a number in the field and the number is not zero.
de: Wenn dieses Feld (oder diese Feldgruppe) nur basierend auf der Antwort auf eine andere Frage oder einer spezifischen Option, die bei einer anderen Frage gewählt wurde, angezeigt werden soll, geben Sie bitte die Frage oder Option an, von der es abhängt. Zum Beispiel wird dieses Feld nur angezeigt, wenn die Textzeile nicht leer ist, falls das andere Feld eine Textzeile ist. Falls das andere Feld ein Zahlenfeld ist, wird dieses Feld nur angezeigt, wenn eine Zahl in das Feld eingetragen wurde und diese Zahl nicht null ist.

source: If this option is checked, all show conditions will be negated. This means that if any of the conditions is present in the request URL, the field will not be displayed.
de: Wenn diese Option aktiviert ist, werden alle Anzeige-Bedingungen negiert. Das bedeutet, wenn eine der Bedingungen in der URL enthalten ist, wird das Feld nicht angezeigt.

source: In an UploadField an user can upload one or multiple files.
de: In einem Upload-Feld können ein oder mehrere Dateien hochgeladen werden.

source: Installs the edi.jsonforms add-on.
de: Installiert die edi.jsonforms Erweiterung.

source: Label of the answer option
de: Label der Antwortoption

source: Label of the button to add new elements. Default: +
de: Label des Knopfes, um neue Elemente hinzuzufügen. Default: +

source: List of options. Every line contains one option. Options can either be values only or have an id in the format "id:value". IDs are only used if "Use id of options in schema" is checked in the parent field.
de: Liste der Optionen. Jede Zeile enthält eine Option. Optionen können entweder nur Werte sein oder eine ID im Format „id:wert“ haben. IDs werden nur verwendet, wenn „Nutze die ID der Optionen im Schema“ im übergeordneten Feld aktiviert ist.

source: Maximum cannot be smaller or equal to zero.
de: Das Maximum kann nicht kleiner oder gleich 0 sein.

source: Maximum cannot be smaller than Minimum.
de: Das Maximum kann nicht kleiner als das Minimum sein.

source: Maximum file size (in MB)
de: Maximale Dateigröße (in MB)

source: Maximum file size for each uploaded file. If empty, there is no limit.
de: Maximale Dateigröße für jede hochgeladene Datei. Wenn keine angegeben ist, gibt es kein Limit.

source: Maximum number of files
de: Maximale Anzahl an Dateien

source: Maximum number of files that can be uploaded. If empty, there is no limit.
de: Maximale Anzahl an Dateien, die hochgeladen werden können. Wenn keine angegeben ist, gibt es kein Limit.

source: Minimum number of files
de: Minimale Anzahl an Dateien

source: Minimum number of files that must be uploaded.
de: Minimale Anzahl an Dateien, die hochgeladen werden müssen.

source: Minimum/Maximum are only valid options for the following answer types: Textline, Textarea, Password, Decimal number, Whole number.
de: Minimum/Maximum sind nur gültige Optionen für die folgenden Antworttypen: Textzeile, Textfeld, Passwort, Dezimalzahl, Ganzzahl.

source: Negate all show conditions
de: Alle Anzeige-Bedingungen negieren

source: Object from which is dependent must be in the same Complex, Array, Fieldset or Form.
de: Eine Abhängigkeit ist nur im selben komplexen Objekt, Array, Formular oder derselben Feldgruppe möglich.

source: Only use this for the answer types Decimal and Whole number (e.g. km, kg).
de: Diese Option gilt nur für die Antworttypen Dezimal- und Ganzzahl (z. B. km, kg).

source: Only use this for the answer types Textline and Textarea.
de: Diese Option gilt nur für die Antworttypen Textzeile und Textfeld.

source: Only use this for the answer types Textline/-area, Password, Telephone, URL, Email.
de: Diese Option gilt nur für die Antworttypen Textzeile/-feld, Passwort, Telefonnummer, URL, Email.

source: OptionList
de: Optionenliste

source: Optional
de: Optionales Feld

source: Options
de: Optionen

source: Password
de: Passwort

source: Placeholder
de: Platzhalter

source: Please add options to this selection field.
de: Bitte fügen Sie Optionen zu diesem Auswahlfeld hinzu.

source: Radiobuttons (single selection)
de: Radiobuttons (Einfachauswahl)

source: Reference
de: Referenz

source: Reference to another Form Element (e.g. Field or Array)
de: Referenz auf ein anderes Fragebogenelement (z. B. Feld oder Array)

source: Regular expression to validate a Textline/-area field.
de: Regulärer Ausdruck gegen den die/das Textzeile/-feld validiert wird.

source: Required
de: Pflichtfeld

source: Selection (single selection)
de: Auswahlmenü (Einfachauswahl)

source: Selection of Field Requirement
de: Auswahl zwischen optionalem Feld und Pflichtfeld

source: SelectionField
de: Auswahlfeld

source: Show element content
de: Elementinhalt anzeigen

source: Show title in form
de: Titel im Fragebogen anzeigen

source: Stable-Versions
de: Stable-Versionen

source: Telephone
de: Telefonnummer

source: Textarea
de: Textfeld

source: Textline
de: Textzeile

source: The Form enables users to create and manage structured questionnaires, surveys or data collection forms. It can contain various field types such as radio buttons, simple text fields and more, organizing them into fieldsets.
de: Der Fragebogen ermöglicht es Felder / Fragestellungen zu erstellen und in Feldgruppen, Arrays oder Objekten zu organisieren.

source: The contents of this field are autogenerated on save with change note. Do not edit it manually.
de: Der Inhalt dieses Feldes wird beim Speichern mit Änderungshinweis automatisch generiert. Bitte nicht manuell bearbeiten.

source: The dependencies have an AND-connection (default: (inklusive) OR). This option is ignored if less than two dependencies are given.
de: Die Abhängigkeiten haben eine und-Verbindung (Default: oder). Diese Option wird ignoriert, wenn weniger als zwei Abhängigkeiten bestehen.

source: The description won't be shown in the form.
de: Die Beschreibung wird nicht im Fragebogen angezeigt.

source: The provided regular expression isn't valid.
de: Der angegebene reguläre Ausdruck ist nicht valide.

source: The referenced object is either empty or deleted/invalid.
de: Das referenzierte Objekt ist entweder leer/ungültig oder wurde gelöscht.

source: The referenced object is not within a Form.
de: Das referenzierte Objekt befindet sich nicht in einem Fragebogen.

source: The referenced object is not within the same Form.
de: Das referenzierte Objekt befindet sich nicht im gleichen Fragebogen.

source: The title won't be shown in the form.
de: Der Titel wird nicht im Fragebogen angezeigt.

source: The user will be forced to upload files individually.
de: Der Formularbenutzer wird gezwungen, Dateien einzeln hochzuladen.

source: This condition is used to determine whether this field should be displayed. If left empty, the field will always be shown. If "condition" is given, the field will only be displayed if the condition is met. The condition is checked using the query parameter "fork" of the request URL. Multiple conditions can be separated by commas. Example: "condition1, condition2, condition3". If any of the conditions is met, the field will be displayed; otherwise it will not.
de: Diese Bedingung wird verwendet, um zu entscheiden, ob das Feld angezeigt werden soll. Wenn keine Bedingung angegeben ist, wird das Feld immer angegeben. Wenn "bedingung" angegeben ist, wird das Feld nur angezeigt, wenn die Bedingung erfüllt ist. Die Bedingung wird mit dem Query-Parameter "fork" der URL überprüft. Mehrere Bedingungen können durch ein Komma getrennt werden. Beispiel: "bedingung1, bedingung2, bedingung3". Wenn eine der Bedingungen erfüllt ist, wird das Feld angezeigt, ansonsten nicht.

source: This helptext can be added between two Fields/Fieldsets and can be used as a helptext for the user to fill out the form.
de: Dieser Hinweistext kann zwischen zwei Feldern/Feldgruppen hinzugefügt werden und als Hilfestellung für den Nutzer, wie der Fragebogen auszufüllen ist, verwendet werden.

source: This is a reference.
de: Dies ist eine Referenz.

source: Time
de: Uhrzeit

source: Title
de: Titel

source: Title of the field/question
de: Titel des Feldes bzw. der Frage

source: Unformatted intern information for the JSON-Schema
de: Unformatierte interne Information für das JSON-Schema

source: Uninstalls the edi.jsonforms add-on.
de: Deinstalliert die edi.jsonforms Erweiterung.

source: Unit is only a valid option for the following answer types: Decimal Number, Whole Number.
de: Eine Einheit ist nur eine gültige Option für die folgenden Antworttypen: Dezimalzahl, Ganzzahl.

source: Unit of the answer
de: Einheit der Antwort

source: UploadField
de: Upload-Feld

source: Use id of options in schema
de: Nutze die ID der Optionen im Schema

source: View element
de: Element anzeigen

source: Whole number
de: Ganzzahl

source: You cannot depend on the object that is referenced.
de: Es kann keine Abhängigkeit zu dem Objekt geben, das referenziert wird.

source: You cannot reference a Fieldset.
de: Feldgruppen können nicht referenziert werden.

source: You cannot reference a Form.
de: Fragebögen können nicht referenziert werden.

source: You cannot reference a Reference.
de: Referenzen können nicht referenziert werden.

source: You cannot reference the object itself.
de: Es kann nicht das Objekt selbst referenziert werden.

source: edi.jsonforms (uninstall)
de: edi.jsonforms (deinstallieren)
